// http://www.mountaineering.org.tw/tw/index.php/2015-09-13-14-48-49/2015-09-13-15-07-13
// const data_1 = `001

// 玉山

// 244806.455

// 2596535.633

// 3952.382

// 南投信義

// 嘉義阿里山

// 高雄桃源

// 002

// 玉山東峰

// 245664

// 2596621

// 3869 公尺

// 南投信義

// 嘉義阿里山

// 003

// 玉山北峰

// 245052

// 2598468

// 3858 公尺

// 南投信義

// 004

// 玉山南峰

// 244960

// 2593942

// 3844 公尺

// 高雄桃源

// 005

// 雪山

// 272679.921

// 2697710.422

// 3885.789

// 苗栗泰安

// 台中和平

// 006

// 秀姑巒山

// 255535

// 2599503

// 3800 公尺

// 花蓮卓溪

// 南投信義

// 007

// 馬博拉斯山

// 256037

// 2602111

// 3765 公尺

// 花蓮卓溪

// 南投信義

// 008

// 南湖大山

// 293746.759

// 2695369.487

// 3741.595

// 台中和平

// 花蓮秀林

// 009

// 大水窟山

// 253116

// 2596962

// 3630 公尺

// 花蓮卓溪

// 南投信義

// 010

// 東小南山

// 245432.526

// 2593106.328

// 3711.189

// 高雄桃源

// 011

// 中央尖山

// 291414.575

// 2689649.624

// 3704.952

// 台中和平

// 花蓮秀林

// 012

// 雪山北峰

// 273550.506

// 2701181.012

// 3703.380

// 苗栗泰安

// 台中和平

// 013

// 關山

// 240136.261

// 2569748.334

// 3668.036

// 台東海端

// 高雄桃源

// 014

// 南湖大山東峰

// 294892

// 2695826

// 3632 公尺

// 台中和平

// 花蓮秀林

// 宜蘭南澳

// 015

// 奇萊主山北峰

// 283176.681

// 2668375.391

// 3606.972

// 花蓮秀林

// 016

// 向陽山

// 248396.038

// 2575969.615

// 3603.083

// 高雄桃源

// 台東海端

// 017

// 大劍山

// 269515.484

// 2693002.903

// 3593.788

// 台中和平

// 018

// 馬利加南山

// 261136

// 2602253

// 3546 公尺

// 花蓮卓溪

// 南投信義

// 019

// 雲峰

// 246692.409

// 2583661.780

// 3563.757

// 高雄桃源

// 020

// 奇萊主山

// 282035.771

// 2664790.863

// 3560.282

// 花蓮秀林

// 南投仁愛

// 021

// 南湖北山

// 293517.154

// 2697790.284

// 3536.002

// 宜蘭大同

// 宜蘭南澳

// 台中和平

// 022

// 品田山

// 276227

// 2702680

// 3524 公尺

// 新竹尖石

// 台中和平

// 023

// 大雪山

// 261468.676

// 2691864.928

// 3529.657

// 苗栗泰安

// 台中和平

// 024

// 玉山西峰

// 242450

// 2596805

// 3490 公尺

// 南投信義

// 嘉義阿里山

// 025

// 南湖大山南峰

// 293267

// 2693815

// 3475 公尺

// 台中和平

// 花蓮秀林

// 026

// 頭鷹山

// 263448.444

// 2695062.723

// 3509.586

// 台中和平

// 苗栗泰安

// 027

// 大霸尖山

// 275330.034

// 2705948.740

// 3491.514

// 新竹尖石

// 苗栗泰安

// 028

// 三叉山

// 252103.809

// 2577397.536

// 3496.137

// 花蓮卓溪

// 台東海端

// 高雄桃源

// 029

// 東郡大山

// 258566.571

// 2613894.788

// 3619.416

// 南投信義

// 030

// 無明山

// 288230.021

// 2683561.840

// 3450.657

// 台中和平

// 花蓮秀林

// 031

// 巴巴山

// 293597.377

// 2693220.936

// 3449.428

// 台中和平

// 花蓮秀林

// 032

// 小霸尖山

// 274724

// 2705707

// 3418 公尺

// 苗栗泰安

// 033

// 馬西山

// 266940.758

// 2598068.773

// 3443.143

// 花蓮卓溪

// 034

// 北合歡山

// 277780.050

// 2675358.298

// 3422.246

// 南投仁愛

// 花蓮秀林

// 035

// 合歡山東峰

// 277734

// 2670283

// 3421 公尺

// 南投仁愛

// 花蓮秀林

// 036

// 合歡山

// 276729.652

// 2671051.897

// 3417.404

// 南投仁愛

// 037

// 八通關山

// 250150.832

// 2598771.277

// 3334.921

// 南投信義

// 038

// 南玉山

// 241497.966

// 2592026.986

// 3382.801

// 高雄桃源

// 039

// 畢祿山

// 284433.635

// 2678926.496

// 3371.348

// 花蓮秀林

// 南投仁愛

// 040

// 東巒大山

// 257492

// 2616323

// 3468 公尺

// 南投信義

// 041

// 奇萊主山南峰

// 277626.055

// 2662037.126

// 3358.024

// 南投仁愛

// 042

// 能高山南峰

// 277471.472

// 2651422.181

// 3349.436

// 南投仁愛

// 花蓮秀林

// 043

// 卓社大山

// 260970.104

// 2636913.081

// 3368.814

// 南投仁愛

// 南投信義

// 044

// 白姑大山

// 260239.647

// 2677680.277

// 3341.508

// 南投仁愛

// 台中和平

// 045

// 新康山

// 262199

// 2579533

// 3331 公尺

// 花蓮卓溪

// 046

// 南雙頭山

// 250248

// 25832793

// 3356 公尺

// 花蓮卓溪

// 高雄桃源

// 047

// 志佳陽大山

// 274670.165

// 2694876.154

// 3288.448

// 台中和平

// 048

// 桃山

// 280087.539

// 2703176.075

// 3324.994

// 新竹尖石

// 台中和平

// 049

// 佳陽山

// 268252.614

// 2689201.363

// 3314.147

// 台中和平

// 050

// 火石山

// 266928.606

// 2697538.160

// 3309.562

// 苗栗泰安

// 台中和平

// 051

// 池有山

// 278388.664

// 2703004.217

// 3302.648

// 新竹尖石

// 台中和平

// 052

// 伊澤山

// 273864.976

// 2707302.432

// 3297.327

// 苗栗泰安

// 新竹尖石

// 053

// 卑南主山

// 236280.233

// 2550161.550

// 3294.585

// 高雄桃源

// 台東海端

// 054

// 郡大山

// 245330

// 2608425

// 3250 公尺

// 南投信義

// 055

// 干卓萬山

// 263325.678

// 2641508.356

// 3283.771

// 南投仁愛

// 056

// 太魯閣大山

// 291976.085

// 2664050.768

// 3282.911

// 花蓮秀林

// 057

// 轆轆山

// 248974.842

// 2587826.441

// 3279.464

// 高雄桃源

// 花蓮卓溪

// 058

// 能高山

// 275651.408

// 2654404.485

// 3262.229

// 南投仁愛

// 花蓮秀林

// 059

// 萬東山西峰

// 268068.082

// 2638836.798

// 3257.987

// 南投仁愛

// 南投信義

// 060

// 屏風山

// 284021.668

// 2671803.656

// 3249.776

// 花蓮秀林

// 061

// 小關山

// 236486.070

// 2561287.199

// 3248.737

// 高雄桃源

// 台東海端

// 062

// 丹大山

// 270964

// 2610994

// 3340 公尺

// 南投信義

// 花蓮萬榮

// 花蓮卓溪

// 063

// 鈴鳴山

// 284880.677

// 2682338.854

// 3272.343

// 台中和平

// 花蓮秀林

// 064

// 牧山

// 265488.856

// 2640054.356

// 3240.907

// 南投仁愛

// 南投信義

// 065

// 前山

// 240760.242

// 2597157.926

// 3238.801

// 南投信義

// 嘉義阿里山

// 066

// 石門山

// 278091.433

// 2672140.277

// 3237.336

// 花蓮秀林

// 南投仁愛

// 067

// 劍山

// 266448

// 2687974

// 3253 公尺

// 台中和平

// 068

// 無雙山

// 255020

// 2609930

// 3231 公尺

// 南投信義

// 069

// 尖山

// 250507

// 2592401

// 3190 公尺

// 南投信義

// 高雄桃源

// 花蓮卓溪

// 070

// 喀西帕南山

// 269114

// 2596397

// 3276 公尺

// 花蓮卓溪

// 071

// 塔關山

// 243258.943

// 2572391.224

// 3221.899

// 台東海端

// 高雄桃源

// 072

// 馬比杉山

// 298446.903

// 2693892.105

// 3210.979

// 宜蘭南澳

// 花蓮秀林

// 073

// 內嶺爾山

// 269182

// 2608649

// 3270 公尺

// 花蓮卓溪

// 074

// 雪山東峰

// 276768.675

// 2698303.296

// 3200.942

// 台中和平

// 075

// 南華山

// 278252.234

// 2659615.052

// 3183.921

// 南投仁愛

// 花蓮秀林

// 076

// 義西請馬至山

// 264814

// 2609440

// 3245 公尺

// 花蓮卓溪

// 南投信義

// 077

// 關山嶺

// 245023.229

// 2574497.875

// 3175.600

// 台東海端

// 高雄桃源

// 078

// 海諾南山

// 240093.584

// 2565043.467

// 3174.555

// 台東海端

// 高雄桃源

// 079

// 中雪山

// 257092.222

// 2692495.892

// 3172.761

// 苗栗泰安

// 080

// 閂山

// 280634.379

// 2683915.649

// 3168.267

// 台中和平

// 081

// 駒盆山

// 252492

// 2605216

// 3109 公尺

// 南投信義

// 082

// 甘藷峰

// 288742.789

// 2687445.235

// 315.764

// 花蓮秀林

// 台中和平

// 083

// 西合歡山

// 274015.331

// 2674920.786

// 3144.632

// 南投仁愛

// 084

// 審馬陣山

// 291517.645

// 2697400.864

// 3141.293

// 宜蘭大同

// 台中和平

// 085

// 喀拉業山

// 281745.052

// 2705100.242

// 3132.994

// 新竹尖石

// 宜蘭大同

// 086

// 庫哈諾辛山

// 238944.079

// 2573590.432

// 3114.832

// 高雄桃源

// 087

// 加利山

// 271088.612

// 2706136.159

// 3112.229

// 苗栗泰安

// 088

// 白石山

// 277148.277

// 2645016.739

// 3109.663

// 南投仁愛

// 花蓮萬榮

// 089

// 六順山

// 273595

// 2624740

// 2999 公尺

// 南投信義

// 花蓮萬榮

// 090

// 磐石山

// 288645.498

// 2666882.052

// 3105.694

// 花蓮秀林

// 091

// 帕托魯山

// 296607.871

// 2666320.758

// 3101.284

// 花蓮秀林

// 092

// 大武山

// 224645.875

// 2503213.855

// 3091.968

// 屏東泰武

// 台東金峰

// 093

// 立霧主山

// 294474.272

// 2669135.025

// 3069.541

// 花蓮秀林

// 094

// 安東軍山

// 276273.117

// 2641157.719

// 3068.040

// 花蓮萬榮

// 南投仁愛

// 095

// 光頭山

// 276853.401

// 2648388.998

// 3060.015

// 南投仁愛

// 花蓮秀林

// 096

// 鹿山

// 247994

// 2594392

// 2981 公尺

// 高雄桃源

// 097

// 巒大山

// 243783

// 2621344

// 3081 公尺

// 南投信義

// 098

// 塔芬山

// 251909.406

// 2589451.854

// 3069.879

// 花蓮卓溪

// 高雄桃源

// 099

// 布拉克桑山

// 257225

// 2570274

// 3020 公尺

// 台東海端

// 花蓮卓溪

// 100

// 羊頭山

// 287746.925

// 2678346.457

// 3034.578

// 花蓮秀林`;

// const t1 = data_1.split(/\n/);
// const t2 = t1.filter(i => i.trim().length !== 0);
// const t3 = t2.map(i => {
// 	if (i.length === 3 && !Number.isNaN(Number(i))) return '^^^' + i;
// 	return i;
// });
// const t4 = t3.join('##');
// const t5 = t4.split('^^^').filter(i => i.length);
// const t6 = t5.map(i => i.split('##'));
// const t7 = t6.map(i => i.filter(i => i.length !== 0));
// const DATA_1 = t7.map(i => {
// 	const obj = {
// 		// id: +i[0],
// 		name: i[1],
// 		elevation: +i[4].slice(0, 4),
// 		location: i[6] || i[5],
// 	};
// 	return obj;
// });

// http://osm.kcwu.csie.org/analyze/peak.html
const data_2 = `1	玉山	23.470002,120.957274	玉山	0.37	1.21
2	雪山	24.383401,121.231754	雪山主峰	2.05	7.68
3	玉山東峰	23.470775,120.965668	玉山東峰	4.67	53.72
4	玉山北峰	23.487452,120.959672	玉山北峰	7.04	19.21
5	玉山南峰	23.446581,120.958784	玉山南峰	2.91	3.77
6	秀姑巒山	23.496791,121.05744	秀姑巒山	12.03	10.62
7	馬博拉斯山	23.520340,121.067236	馬博拉斯山	1.00	0.83
8	南湖大山	24.361805,121.439359	南湖大山	1.32	3.27
9	東小南山	23.439036,120.963411	東小南山	1.58	1.80
10	中央尖山	24.310226,121.416203	中央尖山	2.49	2.59
11	雪山北峰	24.414724,121.240396	雪山北峰	7.84	9.12
12	關山	23.228086,120.911717	關山	2.01	1.11
13	南湖大山東峰	24.365894,121.450661	南湖大山東峰	41.73	10.96
14	大水窟山	23.473853,121.038618	大水窟山	22.89	1.51
15	東郡大山	23.626735,121.092082	東郡大山	25.13	14.11
16	奇萊北峰	24.118339,121.334539	奇萊北峰	1.20	1.05
17	向陽山	23.284291,120.992423	向陽山	8.91	0.62
18	大劍山	24.340941,121.200492	大劍山	3.34	1.01
19	雲峰	23.353743,120.975757	雲峰	1.11	0.05
20	奇萊主山	24.085997,121.323234	奇萊主山	0.72	0.70
21	馬利加南山	23.521592,121.117171	馬利加南山	1.19	0.49
22	南湖北山	24.383669,121.437171	南湖北山	1.80	1.80
23	大雪山	24.330751,121.121182	大雪山	1.91	1.64
24	品田山	24.428214,121.266816	品田山	10.32	5.33
25	玉山西峰	23.472426,120.934205	玉山西峰	85.87	13.56
26	頭鷹山	24.359607,121.140723	頭鷹山	43.50	12.71
27	三叉山	23.297183,121.028671	三叉山	46.48	3.94
28	大霸尖山	24.457743,121.258031	大霸尖山	76.87	58.01
29	南湖大山南峰	24.347784,121.434582	南湖大山南峰	21.67	18.40
30	東巒大山	23.648667,121.081564	東巒大山	1.62	50.59
31	無明山	24.255559,121.384663	無明山	28.77	13.02
32	巴巴山	24.342411,121.437820	巴巴山	1.75	2.11
33	馬西山	23.483755,121.173967	馬西山	1.38	1.38
34	北合歡山	24.181496,121.281587	合歡山北峰	3.20	2.70
35	合歡山東峰	24.135671,121.281033	合歡山東峰	17.85	0.09
36	小霸尖山	24.455570,121.252049	小霸尖山	9.96	10.27
37	合歡山	24.142632,121.271166	合歡山	5.66	6.54
38	南玉山	23.429276,120.924910	南玉山	1.75	1.29
39	畢祿山	24.213579,121.347162	畢祿山	28.88	1.86
40	卓社大山	23.834571,121.115822	卓社大山	1.62	1.62
41	奇萊南峰	24.061219,121.279809	奇萊南峰	1.04	2.80
42	南雙頭山	23.346062,121.010532	南雙頭山	20.02	9.21
43	能高山南峰	23.965374,121.278083	能高山南峰	21.61	6.99
44	白姑大山	24.202683,121.108962	白姑大山	7.04	10.70
45	八通關山	23.490196,121.009592	八通關山	15.92	7.99
46	新康山	23.316418,121.127384	新康山	32.99	7.06
47	丹大山	23.600421,121.213543	丹大山	1.66	0.38
48	桃山	24.432621,121.304898	桃山	4.24	0.54
49	佳陽山	24.306633,121.187996	佳陽山	1.14	0.62
50	火石山	24.381922,121.175055	火石山	1.26	1.26
51	池有山	24.431102,121.288140	池有山	26.31	3.17
52	伊澤山	24.469989,121.243603	伊澤山	7.28	1.56
53	卑南主山	23.051181,120.874204	卑南主山	3.60	2.03
54	郡大山	23.577365,120.962368	郡大山	81.90	15.52
55	志佳陽大山	24.357779,121.251324	志佳陽大山	0.95	0.88
56	干卓萬山	23.876045,121.138989	干卓萬山	1.71	0.88
57	太魯閣大山	24.079077,121.420976	太魯閣大山	0.78	2.88
58	轆轆山	23.391362,120.998080	轆轆山	1.69	0.86
59	喀西帕南山	23.468634,121.195221	克西帕南山	719.44	707.86
60	內嶺爾山	23.579269,121.196050	內嶺爾山	0.10	19.72
61	鈴鳴山	24.244380,121.351647	鈴鳴山	1.48	5.25
62	能高山	23.992334,121.260253	能高山	17.59	9.55
63	萬東山西峰	23.851873,121.185522	火山	1.85	0.79
64	劍山	24.295572,121.170202	劍山	15.93	12.68
65	屏風山	24.149275,121.342934	屏風山	2.72	0.01
66	小關山	23.151654,120.876120	小關山	2.57	3.50
67	義西請馬至山	23.586460,121.153265	義西請馬至山	0.54	23.10
68	牧山	23.862896,121.160214	牧山	1.84	0.87
69	玉山前峰	23.475605,120.917662	玉山前峰	1.47	2.24
70	石門山	24.152435,121.284587	石門山	2.99	1.06
71	無雙山	23.59157,121.05432	無雙山	341.43	324.67
72	塔關山	23.251966,120.942220	塔關山	109.61	106.64
73	馬比杉山	24.348325,121.485633	馬比杉山	2.13	2.29
74	達芬尖山	23.43296,121.01322	達芬尖山	28.17	17.45
75	雪山東峰	24.388687,121.272073	雪山東峰	23.20	15.42
76	南華山	24.039337,121.285918	南華山	5.62	2.26
77	關山嶺山	23.270996,120.959457	關山嶺山	15.74	0.68
78	海諾南山	23.185598,120.911328	海諾南山	2.26	3.41
79	中雪山	24.336476,121.078059	中雪山	27.22	5.22
80	閂山	24.258708,121.309867	閂山	6.93	2.13
81	甘薯峰	24.290393,121.389819	甘薯峰	1.56	3.68
82	西合歡山	24.177610,121.244525	合歡山西峰	6.03	9.56
83	審馬陣山	24.380209,121.417448	審馬陣山	1.70	5.74
84	喀拉業山	24.449960,121.321288	喀拉業山	7.60	0.47
85	庫哈諾辛山	23.262774,120.900042	庫哈諾辛山	4.33	6.23
86	加利山	24.459500,121.216197	加利山	3.24	10.56
87	白石山	23.907542,121.274785	白石山	1.79	1.66
88	磐石山	24.104728,121.388298	磐石山	0.89	2.13
89	帕托魯山	24.099441,121.466602	帕托魯山	0.66	0.48
90	北大武山	22.627075,120.761410	北大武山	3.71	2.11
91	西巒大山	23.694019,120.947166	西巒大山	5.30	2.86
92	塔芬山	23.406038,121.026793	達芬山	1.67	0.63
93	立霧主山	24.124914,121.445703	立霧主山	0.88	3.56
94	安東軍山	23.872712,121.266118	安東軍山	1.81	0.28
95	光頭山	23.937997,121.271952	光頭山	1.86	15.48
96	羊頭山	24.208264,121.379765	羊頭山	3.59	2.48
97	駒盆山 	23.548389,121.032528	盆駒山	3.17	1.88
98	布拉克桑山	23.232838,121.078700	布拉克桑山	1.61	0.89
99	六順山	23.724508,121.239549	六順山	3.03	1.96
100	鹿山	23.450650,120.988479	鹿山	14.67	3.81`;

const p1 = data_2.split('\n');
const p2 = p1.map(i => i.split('\t'));
p2.forEach(i => (i.length = 3));
const DATA_2 = p2.map(i => {
	const position = i[2].split(',');
	return {
		name: i[1].trim(),
		coordinate: {
			lat: +position[0],
			lng: +position[1],
		},
	};
});

// wiki
const data_3 = `1	玉山	A	3952	南投縣、高雄市、嘉義縣	玉山國家公園	五嶽-1	新高山，摩里遜山，臺灣全島、南投縣、高雄市、嘉義縣最高峰。
2	雪山	A	3886	苗栗縣、臺中市	雪霸國家公園	五嶽-2	次高山，西魯維亞山，興隆山，苗栗縣、臺中市最高峰。
3	玉山東峰	C+	3869	南投縣、高雄市	玉山國家公園	十峻-1	新高東山，台東新高，天壘峰
4	玉山北峰	B	3858	南投縣	玉山國家公園	八秀-1	新高北山，斗六新高，天駝峰
5	玉山南峰	C+	3844	高雄市	玉山國家公園	十峻-2	新高南山，天龍峰
6	秀姑巒山	B	3805	花蓮縣、南投縣	玉山國家公園	五嶽-3	馬霍拉斯山，花蓮縣最高峰
7	馬博拉斯山	C+	3785	花蓮縣、南投縣	玉山國家公園	十峻-3	烏拉孟山
8	南湖大山	B	3742	臺中市	太魯閣國家公園	五嶽-4	
9	東小南山	C	3711	高雄市	玉山國家公園	九平-1	
10	中央尖山	C+	3705	臺中市、花蓮縣	太魯閣國家公園	三尖-1	
11	雪山北峰	C+	3703	苗栗縣、臺中市	雪霸國家公園	十潤-2	次高北山，羽利羽利山
12	關山	C	3668	台東縣、高雄市	玉山國家公園	十峻-4	臺東縣最高峰
13	大水窟山	B	3642	花蓮縣、南投縣	玉山國家公園	十潤-1	
14	南湖大山東峰	B	3632	臺中市、花蓮縣、宜蘭縣	太魯閣國家公園	十巖-1	南湖東山，宜蘭縣最高峰。
15	東郡大山	C+	3619	南投縣		十崇-1	卡伊西山
16	奇萊北峰	B	3607	花蓮縣	太魯閣國家公園	十峻-5	
17	向陽山	A	3603	高雄市、台東縣	玉山國家公園	八秀-2	紅葉山
18	大劍山	B	3594	臺中市	雪霸國家公園	十峻-6	巴多瓦諾敏山
19	雲峰	C	3564	高雄市	玉山國家公園	九峨-1	
20	奇萊主山	B	3560	花蓮縣、南投縣	太魯閣國家公園	九峨-2	奇萊主峰
21	馬利加南山	C+	3546	南投縣、花蓮縣	玉山國家公園	十巖-2	塔比拉山
22	南湖北山	B	3536	宜蘭縣、臺中市	太魯閣國家公園	十崇-2	巴油山
23	大雪山	C	3530	苗栗縣、臺中市	雪霸國家公園	十崇-3	
24	品田山	B	3524	新竹縣、臺中市	雪霸國家公園	十峻-7	波秦西崙山
25	玉山西峰	A	3518	嘉義縣、南投縣	玉山國家公園	十翠-4	新高西山，天翠峰
26	頭鷹山	C	3510	臺中市、苗栗縣	雪霸國家公園	九峨-3	
27	三叉山	A	3496	花蓮縣、台東縣、高雄市	玉山國家公園	十崇-3	霞雪沙山
28	大霸尖山	A	3492	新竹縣、苗栗縣	雪霸國家公園	三尖-2	酒桶山，新竹縣最高峰
29	南湖大山南峰	C	3475	臺中市、花蓮縣	太魯閣國家公園	十巖-5	
30	東巒大山	C+	3468	南投縣		八秀-3	
31	無明山	C+	3451	臺中市、花蓮縣	太魯閣國家公園	十峻-8	屈社山.高田山
32	巴巴山	C	3449	臺中市、花蓮縣	太魯閣國家公園	八小巒-1	南湖南山
33	馬西山	C+	3443	花蓮縣	玉山國家公園	十崇-5	拉嘎山.白南山
34	北合歡山	A	3422	南投縣、花蓮縣	太魯閣國家公園	十崇-6	合歡山北峰
35	合歡山東峰		3421	南投縣、花蓮縣	太魯閣國家公園	九峨-4	
36	小霸尖山	B	3418	苗栗縣	雪霸國家公園	八銳-2	
37	合歡山		3417	南投縣	太魯閣國家公園	十潤-3	合歡主峰
38	南玉山	C	3383	高雄市	玉山國家公園	十潤-4	
39	畢祿山	A	3371	花蓮縣、南投縣	太魯閣國家公園	八瘦-3	拉嘎山
40	卓社大山	C	3369	南投縣		九峨-5	
41	奇萊南峰	A	3358	南投縣		十崇-7	
42	南雙頭山	C	3356	花蓮縣、高雄市	玉山國家公園	九峨-6	
43	能高山南峰	C	3349	南投縣、花蓮縣		十峻-9	
44	志佳陽大山	A	3345	臺中市	雪霸國家公園	八秀-4	
45	白姑大山	B	3341	南投縣、臺中市		十翠-6	白狗大山
46	八通關山	A	3335	南投縣	玉山國家公園	八銳-3	
47	新康山	C	3331	花蓮縣	玉山國家公園	十峻-10	新關山
48	丹大山	C	3325	南投縣、花蓮縣		九嶂-3	
49	桃山	A	3325	新竹縣、臺中市	雪霸國家公園	八秀-5	
50	佳陽山	B	3314	臺中市	雪霸國家公園	八銳-4	阿都般山
51	火石山	C	3310	苗栗縣、臺中市	雪霸國家公園	八銳-5	
52	池有山	A	3303	新竹縣、臺中市	雪霸國家公園	六易-1	玉羅府山
53	伊澤山	A	3297	苗栗縣、新竹縣	雪霸國家公園	六易-2	江澤山
54	卑南主山	C	3295	高雄市、台東縣		十崇-8	
55	干卓萬山	C	3284	南投縣		八瘦-4	
56	太魯閣大山	C+	3283	花蓮縣	太魯閣國家公園	十崇-9	
57	轆轆山	C	3279	高雄市	玉山國家公園	八銳-7	馬江之子山
58	喀西帕南山	C+	3276	花蓮縣	玉山國家公園	九偏-4	
59	內嶺爾山	C	3275	花蓮縣		十崇-10	
60	鈴鳴山	B	3272	臺中市、花蓮縣	太魯閣國家公園	八秀-6	
61	郡大山	A	3265	南投縣	玉山國家公園	八秀-7	
62	能高山	C	3262	南投縣、花蓮縣		九峨-7	
63	萬東山西峰	C	3258	南投縣		九偏-5	火山
64	劍山	C	3253	臺中市	雪霸國家公園	九嶂-5	小劍山
65	屏風山	B	3250	花蓮縣	太魯閣國家公園	九嶂-6	
66	小關山	C	3249	高雄市、台東縣		九峨-8	
67	義西請馬至山	C+	3245	花蓮縣、南投縣		七峭-4	
68	牧山	C	3241	南投縣		六易-5	干卓萬東南峰
69	玉山前峰	A	3239	嘉義縣、南投縣	玉山國家公園	六易-5	新高前山，前山
70	石門山		3237	花蓮縣、南投縣	太魯閣國家公園	八小巒-2	
71	無雙山	C+	3231	南投縣		九嶂-7	馬西柔干山
72	塔關山	A	3222	台東縣、高雄市	玉山國家公園	七峭-5	大關山
73	馬比杉山	C	3211	宜蘭縣、花蓮縣	太魯閣國家公園	九平-7	麻眉山
74	達芬尖山	C	3208	南投縣、高雄市、花蓮縣	玉山國家公園	三尖-3	尖山
75	雪山東峰	A	3201	臺中市	雪霸國家公園	八小巒-3	次高東山.明間山
76	南華山	A	3184	南投縣、花蓮縣		八瘦-6	能高山北峰
77	關山嶺山	A	3176	台東縣、高雄市	玉山國家公園	八瘦-7	
78	海諾南山	C	3174	台東縣、高雄市		十潤-6	
79	中雪山	A	3173	苗栗縣	雪霸國家公園	十翠-8	
80	閂山	A	3168	臺中市	太魯閣國家公園	八秀-8	
81	甘薯峰	C+	3158	花蓮縣、臺中市	太魯閣國家公園	八小巒-6	中央南山
82	西合歡山	A	3145	南投縣	太魯閣國家公園	十翠-9	合歡山西峰
83	審馬陣山	A	3141	宜蘭縣、臺中市	太魯閣國家公園	六肩稜-1	夜珍加羅穗山
84	喀拉業山	A	3133	新竹縣、宜蘭縣	雪霸國家公園	六肩稜-2	加留坪山
85	庫哈諾辛山	A	3115	高雄市	玉山國家公園	九偏-8	
86	加利山	A	3112	苗栗縣	雪霸國家公園	六肩稜-3	麥巴拉邊山
87	白石山	C	3110	南投縣、花蓮縣		七峭-6	
88	磐石山	C	3106	花蓮縣	太魯閣國家公園	九偏-9	苫原山
89	帕托魯山	C	3101	花蓮縣	太魯閣國家公園	十潤-8	
90	北大武山	A	3092	屏東縣、台東縣		五嶽-5	大武山，屏東縣最高峰。
91	西巒大山	A	3081	南投縣		七峭-7	巒大山
92	塔芬山	C	3070	花蓮縣、高雄市	玉山國家公園	八銳-8	
93	立霧主山	C	3069	花蓮縣	太魯閣國家公園	十巖-9	塔次基里山
94	安東軍山	C	3068	花蓮縣、南投縣		十潤-9	安東郡山
95	光頭山	C	3060	南投縣、花蓮縣		九平-8	知亞干山
96	羊頭山	A	3035	花蓮縣	太魯閣國家公園	八瘦-8	
97	布拉克桑山	C	3026	台東縣、花蓮縣		九嶂-9	武拉姑散山
98	駒盆山	C+	3022	南投縣	玉山國家公園	六肩稜-4	宇馬薄哥山
99	六順山	B	2999	南投縣、花蓮縣		九平-9	
100	鹿山	C	2981	高雄市	玉山國家公園	六肩稜-6	`;

const w1 = data_3.split('\n').map(i => i.split('\t'));
const DATA_3 = w1.map(i => {
	return {
		id: +i[0],
		name: i[1].trim(),
		level: i[2],
		elevation: +i[3],
		location: i[4],
		park: i[5] || null,
	};
});

/* 名字比對 */

// const comparison = DATA_3.filter(i => {
// 	return !DATA_2.some(j => {
// 		return i.name === j.name;
// 	});
// });

// console.log(comparison);

/* 合併資料 */

const final = DATA_3.map(i => {
	let obj = null;
	DATA_2.forEach(j => {
		if (i.name === j.name) {
			obj = {
				...j,
				...i,
			};
		}
	});
	return obj;
});

// console.table(final);

export default final;
